<template>
  <div>
    <v-row class="mx-auto py-3">
      <v-col cols="11" md="6" class="mx-auto py-0 mt-3" v-for="c in exs" :key="c.name">
        <v-card outlined style="white-space:pre-wrap; word-wrap:break-word;">
          <v-card-title>
            {{ c.name }}
          </v-card-title>
          <v-card-subtitle>
            {{ c.place }}
          </v-card-subtitle>
          <v-card-text>
            {{ c.ex }}
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </div>
</template>

<script>
export default {
    name: 'SchoolEx',
    data: () => ({
      exs: [
        { 
            name: "地歴班展",
            place: "1棟2階122教室\n常設展示",
            ex: "班誌頒布のほか、総会議事録などの古い生徒会資料や校内の碑文を紹介したポスター展示をして います。ぜひ立ち寄ってみてください。"
        },
        {
            name: "文学班",
            place: "1棟2階122教室\n常設展示",
            ex: "去年下半期~今年春までの入選俳句と班誌夏号を展示します。"
        },
        {
            name: "英語班",
            place: "3棟4階LL教室\n常設展示",
            ex: "ディベートの様子展示本活動であるディベートの様子を掲示します。ぜひ見に来てください。"
        },
        {
            name: "「小公女セーラ」\n演劇班",
            place: "3棟4階342教室\n二日目:13:30~\n三日目:10:30~",
            ex: "インドの大尉の娘で7歳のセーラはイギリスの女学院に預けられ、プリンセスのような待遇を受けていた。しかしそこに父が亡くなったという知らせが...逆境でもめげずに生きようとするセーラ。ぜひ物語の結末を見に 3棟4階342番教室へお越しください。"
        },
        {
            name: "家庭科班",
            place: "3棟1階被服室\n常設展示",
            ex: "『夏』をテーマにした個人制作と体験教室を行います。被服室でお待ちしています!"
        },
        {
            name: "写真班",
            place: "多目的教室前\n常設展示",
            ex: "班員が撮影した写真を展示しています。ぜひお越しください。"
        },
        {
            name: "美術班",
            place: "2.3棟渡り廊下\n1階 終日販売\n2階 終日展示",
            ex: "美術班です!1階では班員オリジナルのうちわ販売、2階では作品展示をしています。\n是非お越しください!"
        },
        {
            name: "中学科学班展",
            place: "3棟3階\n理科実験室",
            ex: "中学科学班36人、それぞれのユニークな好奇心あふれる研究結果が、今ここに顕れる。\n実験実演あり〼。"
        },
        {
            name: "新聞班",
            place: "1棟2階122教室\n常設展示",
            ex: "コロナ禍1年間の屋校の出来事をまとめて展示しています。県庁の取材の際にいただいたパンフレットもあります。興味のある人はぜひ122室まで!"
        },
        {
            name: "天文班",
            place: "1棟天文ドーム\n3棟2階地学室\n終日",
            ex: "今年も天文ドームの公開、地学室での展示をします。是非見に来てください。"
        },
        {
            name: "理化班展",
            place: "化学教室\n常設展示",
            ex: "ウニや七味温泉の色の変化に関する研究を展示します。是非見に来てください。"
        },
        {
            name: "理数科展",
            place: "3棟3階\n理科実験室\n12:30~13:30\n(2日目のみ)",
            ex: "理数科が身の回りの不思議について実験します!わっと驚く内容で皆さんを楽しませます!"
        },
        {
            name: "図書館展",
            place: "3棟2階\n理科講義室\n10:00〜14:00",
            ex: "本の収集へのご協力ありがとうございました。\n今年は募金ではなく本を販売します。また、哲学カフェも行います。ぜひ参加して下さい。"
        },
        {
            name: "MHK\nみんなのハト会議",
            place: "中学棟講義室\n3日目のみ",
            ex: "講演者:小布施町役場 倉島志織様「そうだ小布施行こう ~食を通じて地域の魅力を再発見~」 小布施の栗菓子が貰えます! 教室掲示ポスターからお申し込み下さい。"
        },
        {
            name: "保健展",
            place: "1棟1階廊下\n常設展示",
            ex: "おいでよ!保健展!"
        },
        {
            name: "書道班",
            place: "3棟1階書道室\n常設展示",
            ex: "今年は中学生の作品と高校3年生の臨書作品のみを展示します。それぞれ個性豊かな作品となっているので、興味のある方はぜひ見に来てください!"
        },
      ],
    }),
};
</script>

