<template>
  <div>
    <v-row class="mx-auto py-3">
      <v-col cols="11" md="6" class="mx-auto py-0 mt-3" v-for="c in stages" :key="c.name">
        <v-card outlined style="white-space:pre-wrap; word-wrap:break-word;">
          <v-card-title>
            {{ c.name }}
          </v-card-title>
          <v-card-subtitle>
            {{ c.place }}
          </v-card-subtitle>
          <v-card-text>
            {{ c.ex }}
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </div>
</template>

<script>
export default {
    name: 'Stage',
    data: () => ({
      stages: [
        { 
            name: "「Bon Voyage!!」\n高校吹奏楽班",
            place: "2体\n3日目\n14:15~15:00",
            ex: "みなさんに明るく楽しい音楽の旅をお届けします!\nぜひ聴きにお越しください!!"
        },
        { 
            name: "ダンス同好会発表",
            place: "2体\n3日目\n13:00~13:30",
            ex: "JPOP、KPOP、洋楽の様々なジャンルの曲に合わせて踊ります!皆さんと一緒に鳩祭を盛り上げるお手伝いが出来たらなと思います。少しでも良いので是非来て貰えたら嬉しいです。"
        },
        { 
            name: "書道班\n(中高合同)",
            place: "2体\n3日目\n11:30~12:15",
            ex: "中学生は「青春」、高校生は「未来」をテーマに書道パフォーマンスの発表をします。中学生、高校1年生、高校2・3年生で3枚の作品をお届けします。皆さんに楽しんで頂けるように沢山練習しました!是非見に来てください!"
        },
        { 
            name: "弦楽班",
            place: "2体\n2日目\n9:45~10:15\nロビー",
            ex: "ディズニーの曲を多く手掛けているアラン・メンケン作曲「ホールニューワールド」や、リズミカルな「ラデツキー行進曲」などを演奏します。ロビーでの演奏は綺麗に響きます。ぜひ聴きに来てください!"
        },
        { 
            name: "合唱班\n(中高合同)",
            place: "2体\n2日目\n12:45~13:30",
            ex: "皆さんも1度は歌ったことがあるだろう曲を綺麗なハーモニーで歌い上げます!合唱ならではのハモりをご堪能ください!"
        },
        { 
            name: "軽音楽班",
            place: "2体\n2日目\n14:00~15:00\n3日目\n9:45~10:45",
            ex: "ライブハウスが規制されている今、発表の場って少ないんですよね。そんなわけで、この鳩祭は絶好の発表の場。逃がせないこの機会、皆さんにも楽しんでもらって自分たちも楽しむ場所としてこれまで練習してきましたので、どうぞお楽しみに。"
        },
        { 
            name: "中学吹奏楽班\n\n銀河鉄道に\n乗って\nどこまでも",
            place: "2体\n2日目\n10:45~11:15",
            ex: "精いっぱい演奏します!お楽しみに!"
        },
        { 
            name: "ギター・マンドリン班",
            place: "2体\n2日目\n11:30~12:30",
            ex: "定番曲から最近話題の曲まで盛りだくさんのコンサートです!暑い夏にぴったりの爽やかな音色をお届けします!ぜひ聞きに来てください♪"
        },
      ],
    }),
};
</script>

